{
  "irVersion": "0.1.0",
  "tier": "score",
  "meta": {
    "title": "Chitra \u2014 Social Short",
    "register": "social-short",
    "width": 1080,
    "height": 1920,
    "fps": 30,
    "seed": 1,
    "safeZone": "9x16-social"
  },
  "style": {
    "name": "night",
    "palette": {
      "bg": "#0a0a0e",
      "surface": "#1b1b24",
      "primary": "#6e7bf2",
      "accent": "#8ee8c8",
      "text": "#f2f2f6",
      "textDim": "#a2a2ae",
      "onMedia": "#ffffff"
    },
    "fonts": {
      "display": "Space Grotesk",
      "text": "Inter",
      "mono": "JetBrains Mono"
    },
    "displayWeight": 500,
    "textWeight": 400,
    "trackingDisplay": -0.02,
    "grain": 0.05
  },
  "scenes": [
    {
      "id": "hook",
      "reason": "Open on the single message that must land",
      "durationMs": 3000,
      "background": "bg",
      "elements": [
        {
          "type": "shape",
          "id": "glow-a",
          "role": "ambient",
          "shape": "gradient-field",
          "color": "primary",
          "opacity": 0.25,
          "position": {
            "anchor": "center",
            "x": 35,
            "y": 32
          },
          "width": 95,
          "height": 95
        },
        {
          "type": "text",
          "id": "hook-line",
          "role": "hero",
          "textRole": "display",
          "content": "Say it once.",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 46
          },
          "maxWidth": 80
        }
      ],
      "choreography": [
        {
          "id": "glow-a-drift",
          "target": "glow-a",
          "preset": "drift",
          "direction": "right",
          "distance": 5,
          "override": {
            "reason": "ambient field travels the full scene length",
            "durationMs": 3000
          }
        },
        {
          "id": "hook-in",
          "target": "hook-line",
          "preset": "fade-up",
          "duration": "emphasis",
          "at": {
            "after": "scene-start",
            "offsetMs": 250
          }
        }
      ],
      "transitionOut": {
        "type": "fade",
        "duration": "standard"
      }
    },
    {
      "id": "proof",
      "reason": "Back the claim with one concrete beat",
      "durationMs": 3600,
      "background": "surface",
      "elements": [
        {
          "type": "text",
          "id": "proof-line",
          "role": "hero",
          "textRole": "headline",
          "content": "Then prove it.",
          "align": "left",
          "position": {
            "anchor": "left",
            "x": 10,
            "y": 46
          },
          "maxWidth": 78
        },
        {
          "type": "shape",
          "id": "underline",
          "role": "ambient",
          "shape": "line",
          "color": "accent",
          "position": {
            "anchor": "left",
            "x": 10,
            "y": 54
          },
          "width": 12
        },
        {
          "type": "shape",
          "id": "glow-b",
          "role": "ambient",
          "shape": "gradient-field",
          "color": "accent",
          "opacity": 0.1,
          "position": {
            "anchor": "center",
            "x": 75,
            "y": 70
          },
          "width": 90,
          "height": 90
        }
      ],
      "choreography": [
        {
          "id": "glow-b-drift",
          "target": "glow-b",
          "preset": "drift",
          "direction": "right",
          "distance": 5,
          "override": {
            "reason": "ambient field travels the full scene length",
            "durationMs": 3600
          }
        },
        {
          "id": "proof-in",
          "target": "proof-line",
          "preset": "line-reveal",
          "duration": "emphasis",
          "at": {
            "after": "scene-start",
            "offsetMs": 300
          }
        },
        {
          "id": "underline-in",
          "target": "underline",
          "preset": "draw-line",
          "duration": "dramatic",
          "at": {
            "after": "proof-in",
            "offsetMs": 0
          }
        }
      ],
      "transitionOut": {
        "type": "cut",
        "duration": "standard"
      }
    },
    {
      "id": "close",
      "reason": "Land the name and leave",
      "durationMs": 3000,
      "background": "bg",
      "elements": [
        {
          "type": "shape",
          "id": "glow-c",
          "role": "ambient",
          "shape": "gradient-field",
          "color": "primary",
          "opacity": 0.2,
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 55
          },
          "width": 100,
          "height": 100
        },
        {
          "type": "text",
          "id": "brand",
          "role": "hero",
          "textRole": "title",
          "content": "Chitra",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 50
          },
          "maxWidth": 80
        }
      ],
      "choreography": [
        {
          "id": "glow-c-in",
          "target": "glow-c",
          "preset": "scale-drift",
          "override": {
            "reason": "slow ambient swell under the closing card",
            "durationMs": 3000
          }
        },
        {
          "id": "brand-in",
          "target": "brand",
          "preset": "scale-settle",
          "duration": "emphasis",
          "at": {
            "after": "scene-start",
            "offsetMs": 250
          }
        },
        {
          "id": "brand-out",
          "target": "brand",
          "preset": "fade-out",
          "duration": "standard",
          "at": {
            "after": "brand-in",
            "offsetMs": 1400
          }
        }
      ],
      "transitionOut": {
        "type": "cut",
        "duration": "standard"
      }
    }
  ]
}