{
  "irVersion": "0.1.0",
  "tier": "score",
  "meta": {
    "title": "Chitra — Taste is the product",
    "register": "brand-film",
    "width": 1920,
    "height": 1080,
    "fps": 30,
    "seed": 7,
    "safeZone": "16x9-standard"
  },
  "style": {
    "name": "chitra-night",
    "palette": {
      "bg": "#0f0a1e",
      "surface": "#1e1433",
      "primary": "#8b5cf6",
      "accent": "#c084fc",
      "text": "#f5f3ff",
      "textDim": "#a78bfa",
      "onMedia": "#ffffff"
    },
    "fonts": {
      "display": "Space Grotesk",
      "text": "Inter",
      "mono": "JetBrains Mono"
    },
    "displayWeight": 500,
    "textWeight": 400,
    "trackingDisplay": -0.02,
    "grain": 0
  },
  "scenes": [
    {
      "id": "cold-open",
      "reason": "State the brand and thesis in one breath before explaining anything",
      "durationMs": 3600,
      "background": "bg",
      "elements": [
        {
          "type": "shape",
          "id": "glow",
          "role": "ambient",
          "shape": "gradient-field",
          "color": "primary",
          "opacity": 0.47,
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 50
          },
          "width": 110,
          "height": 110
        },
        {
          "type": "text",
          "id": "kicker",
          "role": "support",
          "textRole": "kicker",
          "content": "CHITRA",
          "color": "accent",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 33
          },
          "align": "center"
        },
        {
          "type": "text",
          "id": "thesis",
          "role": "hero",
          "textRole": "display",
          "content": "🚀 Ship 10x faster.",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 51
          },
          "maxWidth": 72,
          "align": "center"
        }
      ],
      "choreography": [
        {
          "id": "glow-drift",
          "target": "glow",
          "preset": "drift",
          "direction": "right",
          "distance": 6,
          "override": {
            "reason": "ambient field travels the full scene length",
            "durationMs": 3600
          }
        },
        {
          "id": "kicker-in",
          "target": "kicker",
          "preset": "scale-settle",
          "duration": "standard",
          "at": {
            "after": "scene-start",
            "offsetMs": 250
          },
          "easing": "spring-energetic"
        },
        {
          "id": "thesis-in",
          "target": "thesis",
          "preset": "scale-settle",
          "duration": "dramatic",
          "at": {
            "after": "kicker-in",
            "offsetMs": 120
          },
          "easing": "spring-energetic"
        }
      ],
      "transitionOut": {
        "type": "fade",
        "duration": "standard"
      }
    },
    {
      "id": "problem",
      "reason": "Name the gap every existing tool leaves open — sets up why Chitra exists",
      "durationMs": 4400,
      "background": "bg",
      "elements": [
        {
          "type": "text",
          "id": "line-a",
          "role": "hero",
          "textRole": "headline",
          "content": "Every tool renders.",
          "align": "center",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 44
          },
          "maxWidth": 60
        },
        {
          "type": "text",
          "id": "line-b",
          "role": "support",
          "textRole": "headline",
          "content": "Almost none direct.",
          "color": "text-dim",
          "align": "center",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 56
          },
          "maxWidth": 60
        },
        {
          "type": "shape",
          "id": "rule",
          "role": "ambient",
          "shape": "line",
          "color": "accent",
          "position": {
            "anchor": "left",
            "x": 12,
            "y": 50
          },
          "width": 14
        },
        {
          "type": "shape",
          "id": "glow-p",
          "role": "ambient",
          "shape": "gradient-field",
          "color": "primary",
          "opacity": 0.27,
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 50
          },
          "width": 110,
          "height": 110
        }
      ],
      "choreography": [
        {
          "id": "glowp-drift",
          "target": "glow-p",
          "preset": "drift",
          "direction": "down",
          "distance": 5,
          "override": {
            "reason": "ambient field travels the full scene length",
            "durationMs": 4400
          }
        },
        {
          "id": "a-in",
          "target": "line-a",
          "preset": "scale-settle",
          "duration": "emphasis",
          "at": {
            "after": "scene-start",
            "offsetMs": 300
          },
          "easing": "spring-energetic"
        },
        {
          "id": "rule-in",
          "target": "rule",
          "preset": "scale-settle",
          "duration": "dramatic",
          "at": {
            "after": "a-in",
            "offsetMs": 0
          },
          "easing": "spring-energetic"
        },
        {
          "id": "b-in",
          "target": "line-b",
          "preset": "scale-settle",
          "duration": "emphasis",
          "at": {
            "after": "a-in",
            "offsetMs": 350
          },
          "easing": "spring-energetic"
        }
      ],
      "transitionOut": {
        "type": "cut",
        "duration": "standard"
      }
    },
    {
      "id": "where-tools-invest",
      "reason": "One picture of the industry's imbalance — evidence, not assertion",
      "durationMs": 4800,
      "background": "surface",
      "elements": [
        {
          "type": "shape",
          "id": "glow-c",
          "role": "ambient",
          "shape": "gradient-field",
          "color": "primary",
          "opacity": 0.25,
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 50
          },
          "width": 110,
          "height": 110
        },
        {
          "type": "text",
          "id": "chart-kicker",
          "role": "support",
          "textRole": "kicker",
          "content": "WHERE TODAY'S TOOLS INVEST",
          "color": "text-dim",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 22
          },
          "align": "center"
        },
        {
          "type": "chart-bar",
          "id": "invest",
          "role": "hero",
          "series": [
            {
              "label": "Rendering",
              "value": 90
            },
            {
              "label": "Templates",
              "value": 55
            },
            {
              "label": "Direction",
              "value": 18
            },
            {
              "label": "Critique",
              "value": 6
            }
          ],
          "highlight": 3,
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 56
          },
          "width": 56,
          "height": 44
        }
      ],
      "choreography": [
        {
          "id": "glowc-drift",
          "target": "glow-c",
          "preset": "drift",
          "direction": "right",
          "distance": 4,
          "override": {
            "reason": "ambient field travels the full scene length",
            "durationMs": 4800
          }
        },
        {
          "id": "ck-in",
          "target": "chart-kicker",
          "preset": "scale-settle",
          "duration": "standard",
          "at": {
            "after": "scene-start",
            "offsetMs": 250
          },
          "easing": "spring-energetic"
        },
        {
          "id": "bars-in",
          "target": "invest",
          "preset": "scale-settle",
          "duration": "emphasis",
          "easing": "spring-energetic",
          "at": {
            "after": "ck-in",
            "offsetMs": 100
          },
          "stagger": {
            "eachMs": 60,
            "from": "start"
          }
        }
      ],
      "transitionOut": {
        "type": "fade",
        "duration": "standard"
      }
    },
    {
      "id": "the-loop",
      "reason": "The mechanism in three words — the whole architecture as a mantra",
      "durationMs": 4600,
      "background": "bg",
      "elements": [
        {
          "type": "shape",
          "id": "glow-2",
          "role": "ambient",
          "shape": "gradient-field",
          "color": "primary",
          "opacity": 0.29000000000000004,
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 50
          },
          "width": 110,
          "height": 110
        },
        {
          "type": "text",
          "id": "loop-direct",
          "role": "hero",
          "textRole": "display",
          "content": "✨ Direct.",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 38
          },
          "align": "center"
        },
        {
          "type": "text",
          "id": "loop-critique",
          "role": "support",
          "textRole": "display",
          "content": "Critique.",
          "color": "primary",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 51
          },
          "align": "center"
        },
        {
          "type": "text",
          "id": "loop-revise",
          "role": "support",
          "textRole": "display",
          "content": "Revise.",
          "color": "accent",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 64
          },
          "align": "center"
        }
      ],
      "choreography": [
        {
          "id": "glow2-drift",
          "target": "glow-2",
          "preset": "drift",
          "direction": "left",
          "distance": 5,
          "override": {
            "reason": "ambient field travels the full scene length",
            "durationMs": 4600
          }
        },
        {
          "id": "d-in",
          "target": "loop-direct",
          "preset": "scale-settle",
          "duration": "emphasis",
          "at": {
            "after": "scene-start",
            "offsetMs": 300
          },
          "easing": "spring-energetic"
        },
        {
          "id": "c-in",
          "target": "loop-critique",
          "preset": "scale-settle",
          "duration": "emphasis",
          "at": {
            "after": "d-in",
            "offsetMs": 150
          },
          "easing": "spring-energetic"
        },
        {
          "id": "r-in",
          "target": "loop-revise",
          "preset": "scale-settle",
          "duration": "emphasis",
          "at": {
            "after": "c-in",
            "offsetMs": 150
          },
          "easing": "spring-energetic"
        }
      ],
      "transitionOut": {
        "type": "fade-through-black",
        "duration": "emphasis"
      }
    },
    {
      "id": "the-guarantee",
      "reason": "Ground the promise in the deterministic machine underneath",
      "durationMs": 4200,
      "background": "bg",
      "elements": [
        {
          "type": "text",
          "id": "gtitle",
          "role": "hero",
          "textRole": "title",
          "content": "Every frame, a pure function of time.",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 46
          },
          "maxWidth": 64,
          "align": "center"
        },
        {
          "type": "text",
          "id": "gsub",
          "role": "support",
          "textRole": "caption",
          "content": "Validated. Gated. Watched.",
          "color": "text-dim",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 58
          },
          "maxWidth": 56,
          "align": "center"
        },
        {
          "type": "shape",
          "id": "glow-g",
          "role": "ambient",
          "shape": "gradient-field",
          "color": "primary",
          "opacity": 0.29000000000000004,
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 50
          },
          "width": 110,
          "height": 110
        }
      ],
      "choreography": [
        {
          "id": "glowg-drift",
          "target": "glow-g",
          "preset": "drift",
          "direction": "up",
          "distance": 4,
          "override": {
            "reason": "ambient field travels the full scene length",
            "durationMs": 4200
          }
        },
        {
          "id": "gt-in",
          "target": "gtitle",
          "preset": "scale-settle",
          "duration": "dramatic",
          "at": {
            "after": "scene-start",
            "offsetMs": 250
          },
          "easing": "spring-energetic"
        },
        {
          "id": "gs-in",
          "target": "gsub",
          "preset": "scale-settle",
          "duration": "emphasis",
          "at": {
            "after": "gt-in",
            "offsetMs": 100
          },
          "easing": "spring-energetic"
        }
      ],
      "transitionOut": {
        "type": "fade",
        "duration": "standard"
      }
    },
    {
      "id": "close",
      "reason": "Land the name and the category, then leave — no lingering outro slop",
      "durationMs": 4200,
      "background": "bg",
      "elements": [
        {
          "type": "shape",
          "id": "glow-3",
          "role": "ambient",
          "shape": "gradient-field",
          "color": "primary",
          "opacity": 0.41000000000000003,
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 50
          },
          "width": 110,
          "height": 110
        },
        {
          "type": "text",
          "id": "logo",
          "role": "hero",
          "textRole": "display",
          "content": "🚀 Chitra",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 48
          },
          "align": "center"
        },
        {
          "type": "text",
          "id": "tag",
          "role": "support",
          "textRole": "caption",
          "content": "Cinematic video, directed by AI.",
          "color": "text-dim",
          "position": {
            "anchor": "center",
            "x": 50,
            "y": 58
          },
          "align": "center"
        }
      ],
      "choreography": [
        {
          "id": "glow3-in",
          "target": "glow-3",
          "preset": "scale-drift",
          "override": {
            "reason": "slow ambient swell under the closing card",
            "durationMs": 4200
          }
        },
        {
          "id": "logo-in",
          "target": "logo",
          "preset": "scale-settle",
          "duration": "emphasis",
          "at": {
            "after": "scene-start",
            "offsetMs": 250
          },
          "easing": "spring-energetic"
        },
        {
          "id": "tag-in",
          "target": "tag",
          "preset": "scale-settle",
          "duration": "emphasis",
          "at": {
            "after": "logo-in",
            "offsetMs": 120
          },
          "easing": "spring-energetic"
        },
        {
          "id": "logo-out",
          "target": "logo",
          "preset": "scale-settle",
          "duration": "standard",
          "at": {
            "after": "tag-in",
            "offsetMs": 2300
          },
          "easing": "spring-energetic"
        },
        {
          "id": "tag-out",
          "target": "tag",
          "preset": "scale-settle",
          "duration": "standard",
          "at": {
            "after": "tag-in",
            "offsetMs": 2300
          },
          "easing": "spring-energetic"
        }
      ],
      "transitionOut": {
        "type": "cut",
        "duration": "standard"
      }
    }
  ]
}